Silexperience210/esp32-cam-surveillance-system/firmware/esp32-s3-monitor/esp32-viewer-s3.ino
/*
 * ESP32-S3 4827S043 — Moniteur multi-cameras tactile v2
 * ------------------------------------------------------
 * - Portail web de configuration WiFi (rien a coder)
 * - AUTO-SCAN du reseau : detecte les ESP32-CAM tout seul
 * - Clavier tactile : ajout manuel d'une camera par IP
 * - Vue grille multi-cams + plein ecran au tap
 *
 * Hardware : ESP32-4827S043C (ecran RGB 480x272 + tactile GT911)
 * Librairie : LovyanGFX
 */

#define LGFX_USE_V1
#include <LovyanGFX.hpp>
#include <lgfx/v1/platforms/esp32s3/Panel_RGB.hpp>
#include <lgfx/v1/platforms/esp32s3/Bus_RGB.hpp>
#include <driver/i2c.h>
#include <WiFi.h>
#include <HTTPClient.h>
#include <Preferences.h>
#include <ESPmDNS.h>
#include "esp_http_server.h"
#include "esp_heap_caps.h"

// ===================== CONFIGURATION =====================
// Rien a modifier ici : le WiFi se configure via le portail web,
// les cameras via l'ecran tactile (scan auto ou ajout manuel).

const int MAX_CAMS = 4;
const unsigned long GRID_CYCLE_MS = 900;    // tour complet de la grille
const int HTTP_TIMEOUT_MS = 2500;
const int PROBE_TIMEOUT_MS = 600;           // timeout par IP pendant le scan
const int ADD_TIMEOUT_MS = 2000;            // timeout pour l'ajout manuel (IP precise)

// ============ DRIVER ECRAN : ESP32-4827S043 (480x272 RGB) ===========

class LGFX : public lgfx::LGFX_Device {
public:
  lgfx::Bus_RGB     _bus_instance;
  lgfx::Panel_RGB   _panel_instance;
  lgfx::Light_PWM   _light_instance;
  lgfx::Touch_GT911 _touch_instance;

  LGFX(void) {
    {
      auto cfg = _panel_instance.config();
      cfg.memory_width  = 480;
      cfg.memory_height = 272;
      cfg.panel_width   = 480;
      cfg.panel_height  = 272;
      cfg.offset_x = 0;
      cfg.offset_y = 0;
      _panel_instance.config(cfg);
    }
    {
      auto cfg = _panel_instance.config_detail();
      cfg.use_psram = 1;
      _panel_instance.config_detail(cfg);
    }
    {
      auto cfg = _bus_instance.config();
      cfg.panel = &_panel_instance;
      cfg.pin_d0  = GPIO_NUM_8;   // B0
      cfg.pin_d1  = GPIO_NUM_3;   // B1
      cfg.pin_d2  = GPIO_NUM_46;  // B2
      cfg.pin_d3  = GPIO_NUM_9;   // B3
      cfg.pin_d4  = GPIO_NUM_1;   // B4
      cfg.pin_d5  = GPIO_NUM_5;   // G0
      cfg.pin_d6  = GPIO_NUM_6;   // G1
      cfg.pin_d7  = GPIO_NUM_7;   // G2
      cfg.pin_d8  = GPIO_NUM_15;  // G3
      cfg.pin_d9  = GPIO_NUM_16;  // G4
      cfg.pin_d10 = GPIO_NUM_4;   // G5
      cfg.pin_d11 = GPIO_NUM_45;  // R0
      cfg.pin_d12 = GPIO_NUM_48;  // R1
      cfg.pin_d13 = GPIO_NUM_47;  // R2
      cfg.pin_d14 = GPIO_NUM_21;  // R3
      cfg.pin_d15 = GPIO_NUM_14;  // R4
      cfg.pin_henable = GPIO_NUM_40;  // DE
      cfg.pin_vsync   = GPIO_NUM_41;
      cfg.pin_hsync   = GPIO_NUM_39;
      cfg.pin_pclk    = GPIO_NUM_42;
      cfg.freq_write  = 9000000;
      cfg.hsync_polarity    = 0;
      cfg.hsync_front_porch = 1;
      cfg.hsync_pulse_width = 1;
      cfg.hsync_back_porch  = 43;
      cfg.vsync_polarity    = 0;
      cfg.vsync_front_porch = 3;
      cfg.vsync_pulse_width = 1;
      cfg.vsync_back_porch  = 12;
      cfg.pclk_active_neg   = 1;
      _bus_instance.config(cfg);
    }
    _panel_instance.setBus(&_bus_instance);
    {
      auto cfg = _light_instance.config();
      cfg.pin_bl = GPIO_NUM_2;
      _light_instance.config(cfg);
    }
    _panel_instance.light(&_light_instance);
    {
      auto cfg = _touch_instance.config();
      cfg.x_min = 0;
      cfg.x_max = 480;
      cfg.y_min = 0;
      cfg.y_max = 272;
      cfg.pin_int = GPIO_NUM_18;
      cfg.pin_rst = GPIO_NUM_38;
      cfg.bus_shared = false;
      cfg.offset_rotation = 0;
      cfg.i2c_port = I2C_NUM_1;
      cfg.pin_sda = GPIO_NUM_19;
      cfg.pin_scl = GPIO_NUM_20;
      cfg.freq = 400000;
      cfg.i2c_addr = 0x5D;
      _touch_instance.config(cfg);
      _panel_instance.setTouch(&_touch_instance);
    }
    setPanel(&_panel_instance);
  }
};

LGFX tft;

// ============================ ETAT GLOBAL ===========================

struct Cam { String name; String ip; };
Cam cams[4];
int nbCams = 0;

String cfgSsid, cfgPass;
bool configMode = false;

enum ViewMode { MODE_GRID, MODE_FULL, MODE_SCAN, MODE_ADD };
ViewMode viewMode = MODE_GRID;
int fullCamIndex = 0;
bool camOnline[4] = {false, false, false, false};
int gridCursor = 0;
unsigned long lastGridFetch = 0;

// saisie clavier
String inputIp;
String addMessage;
unsigned long addMessageMs = 0;

// bouton effacer (double tap confirmation)
bool pendingClear = false;
unsigned long pendingClearMs = 0;

// Le framebuffer RGB du panneau vit deja en PSRAM et son DMA le relit en continu.
// Garder jpgBuf en PSRAM ajoute 2 acces concurrents sur le meme bus -> decodage lent.
// Une frame HVGA/VGA en q16 fait 15-45 ko : 96 ko de DRAM interne suffisent largement.
const size_t JPG_BUF_SIZE      = 96 * 1024;    // tentative en DRAM interne
const size_t JPG_BUF_SIZE_PSRAM = 220 * 1024;  // repli PSRAM si la DRAM est trop juste
size_t jpgBufSize = 0;
uint8_t* jpgBuf = nullptr;
size_t jpgLen = 0;

// ================== CONFIGURATION (flash NVS) =======================

void loadConfig() {
  Preferences prefs;
  prefs.begin("viewer", true);
  cfgSsid = prefs.getString("ssid", "");
  cfgPass = prefs.getString("pass", "");
  prefs.end();
}

void saveWifi() {
  Preferences prefs;
  prefs.begin("viewer", false);
  prefs.putString("ssid", cfgSsid);
  prefs.putString("pass", cfgPass);
  prefs.end();
}

void loadCams() {
  Preferences prefs;
  prefs.begin("viewer", true);
  nbCams = prefs.getUChar("ncam", 0);
  if (nbCams > MAX_CAMS) nbCams = MAX_CAMS;
  for (int i = 0; i < nbCams; i++) {
    cams[i].name = prefs.getString(("cam" + String(i) + "n").c_str(), "");
    cams[i].ip   = prefs.getString(("cam" + String(i) + "i").c_str(), "");
  }
  prefs.end();
}

void saveCams() {
  Preferences prefs;
  prefs.begin("viewer", false);
  prefs.putUChar("ncam", nbCams);
  for (int i = 0; i < nbCams; i++) {
    prefs.putString(("cam" + String(i) + "n").c_str(), cams[i].name);
    prefs.putString(("cam" + String(i) + "i").c_str(), cams[i].ip);
  }
  prefs.end();
}

// ==================== PORTAIL WEB CONFIG WIFI =======================

String urlDecode(const String& s) {
  String out;
  for (size_t i = 0; i < s.length(); i++) {
    if (s[i] == '+') out += ' ';
    else if (s[i] == '%' && i + 2 < s.length()) {
      char h[3] = { s[i + 1], s[i + 2], 0 };
      out += (char)strtol(h, NULL, 16);
      i += 2;
    } else out += s[i];
  }
  return out;
}

String postParam(const String& body, const char* key) {
  String k = String(key) + "=";
  int i = body.indexOf(k);
  if (i < 0) return "";
  int start = i + k.length();
  int end = body.indexOf('&', start);
  if (end < 0) end = body.length();
  return urlDecode(body.substring(start, end));
}

String configPage() {
  String h = F("<!DOCTYPE html><html><head><meta charset='utf-8'>"
    "<meta name='viewport' content='width=device-width,initial-scale=1'>"
    "<title>Moniteur - Config WiFi</title><style>"
    "body{font-family:sans-serif;background:#111;color:#eee;max-width:420px;margin:20px auto;padding:0 15px}"
    "input{width:100%;padding:10px;margin:5px 0 15px;border-radius:6px;border:1px solid #444;background:#222;color:#eee;box-sizing:border-box}"
    "button{width:100%;padding:12px;background:#1976d2;color:#fff;border:0;border-radius:6px;font-size:16px;cursor:pointer}"
    "label{color:#aaa;font-size:14px}h2{text-align:center}"
    ".info{background:#1b3a1b;padding:10px;border-radius:6px;font-size:13px;margin-bottom:15px}"
    "</style></head><body>");
  h += "<h2>&#x1F4FA; Moniteur cameras — WiFi</h2>";
  h += "<div class='info'>Configure le WiFi du moniteur. Les cameras s'ajoutent ensuite directement sur l'ecran tactile (scan automatique ou ajout manuel).</div>";
  h += F("<form method='POST' action='/save'>"
    "<label>Nom du reseau WiFi (SSID)</label>"
    "<input name='ssid' list='nets' value='");
  h += cfgSsid;
  h += F("' required><datalist id='nets'></datalist>"
    "<label>Mot de passe WiFi</label>"
    "<input name='pass' type='password' placeholder='(laisser vide = inchange)'>"
    "<button type='submit'>&#x1F4BE; Enregistrer et redemarrer</button></form>"
    "<script>fetch('/scan').then(r=>r.json()).then(d=>{var dl=document.getElementById('nets');"
    "d.forEach(function(n){var o=document.createElement('option');o.value=n.ssid;o.label=n.rssi+' dBm';dl.appendChild(o);});});</script>"
    "</body></html>");
  return h;
}

static esp_err_t config_handler(httpd_req_t* req) {
  httpd_resp_set_type(req, "text/html");
  String page = configPage();
  return httpd_resp_send(req, page.c_str(), page.length());
}

static esp_err_t scan_handler(httpd_req_t* req) {
  httpd_resp_set_type(req, "application/json");
  int n = WiFi.scanNetworks();
  if (n > 20) n = 20;
  String json = "[";
  for (int i = 0; i < n; i++) {
    if (i) json += ",";
    json += "{\"ssid\":\"" + WiFi.SSID(i) + "\",\"rssi\":" + String(WiFi.RSSI(i)) + "}";
  }
  json += "]";
  WiFi.scanDelete();
  return httpd_resp_send(req, json.c_str(), json.length());
}

static esp_err_t save_handler(httpd_req_t* req) {
  char buf[512];
  int len = min((int)sizeof(buf) - 1, (int)req->content_len);
  int ret = httpd_req_recv(req, buf, len);
  if (ret <= 0) { httpd_resp_send_500(req); return ESP_FAIL; }
  buf[ret] = 0;
  String body = buf;
  String s = postParam(body, "ssid");
  if (s.length()) cfgSsid = s;
  s = postParam(body, "pass");
  if (s.length()) cfgPass = s;
  saveWifi();

