Silexperience210/esp32-cam-surveillance-system/firmware/esp32-s3-monitor/esp32-viewer-s3.ino
  httpd_resp_set_type(req, "text/html");
  httpd_resp_send(req,
    "<html><head><meta charset='utf-8'></head>"
    "<body style='font-family:sans-serif;background:#111;color:#eee;text-align:center;padding-top:50px'>"
    "<h2>&#x2705; WiFi sauvegarde !</h2><p>Redemarrage... Regarde l'ecran du moniteur.</p></body></html>",
    HTTPD_RESP_USE_STRLEN);
  delay(2000);
  ESP.restart();
  return ESP_OK;
}

void startConfigPortal() {
  configMode = true;
  String mac = WiFi.macAddress();
  String apName = "ESP32-Viewer-Setup-" + mac.substring(12, 14) + mac.substring(15, 17);
  WiFi.mode(WIFI_AP_STA);
  WiFi.softAP(apName.c_str(), "12345678");
  Serial.println("\n=== MODE CONFIGURATION ===");
  Serial.println("Reseau WiFi : " + apName + "  (mdp : 12345678)");
  Serial.print("Portail : http://");
  Serial.println(WiFi.softAPIP());

  httpd_config_t config = HTTPD_DEFAULT_CONFIG();
  config.server_port = 80;
  config.max_uri_handlers = 4;
  httpd_handle_t server = NULL;
  httpd_uri_t form = { .uri = "/",     .method = HTTP_GET,  .handler = config_handler, .user_ctx = NULL };
  httpd_uri_t scan = { .uri = "/scan", .method = HTTP_GET,  .handler = scan_handler,   .user_ctx = NULL };
  httpd_uri_t save = { .uri = "/save", .method = HTTP_POST, .handler = save_handler,   .user_ctx = NULL };
  if (httpd_start(&server, &config) == ESP_OK) {
    httpd_register_uri_handler(server, &form);
    httpd_register_uri_handler(server, &scan);
    httpd_register_uri_handler(server, &save);
  }

  // Ecran d'instructions
  tft.fillScreen(TFT_BLACK);
  tft.setTextColor(TFT_YELLOW, TFT_BLACK);
  tft.setFont(&fonts::Font4);
  tft.drawCentreString("Configuration requise", 240, 40);
  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.setFont(&fonts::Font2);
  tft.drawCentreString("1. Connecte-toi au WiFi :", 240, 95);
  tft.setTextColor(TFT_CYAN, TFT_BLACK);
  tft.drawCentreString(apName, 240, 118);
  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.drawCentreString("mot de passe : 12345678", 240, 141);
  tft.drawCentreString("2. Ouvre dans ton navigateur :", 240, 180);
  tft.setTextColor(TFT_CYAN, TFT_BLACK);
  tft.drawCentreString("http://192.168.4.1", 240, 203);
  tft.setTextColor(0x7BC8, TFT_BLACK);
  tft.drawCentreString("Configure le WiFi puis le moniteur redemarre", 240, 240);
}

// ============================ RESEAU ================================

// Telecharge une photo JPEG depuis /capture d'une camera
bool fetchCapture(const String& ip) {
  HTTPClient http;
  http.begin("http://" + ip + "/capture");
  http.setTimeout(HTTP_TIMEOUT_MS);
  int code = http.GET();
  if (code != HTTP_CODE_OK) { http.end(); return false; }
  WiFiClient* stream = http.getStreamPtr();
  size_t total = 0;
  unsigned long start = millis();
  while (http.connected() && total < jpgBufSize && millis() - start < 4000) {
    size_t avail = stream->available();
    if (avail) {
      int r = stream->readBytes(jpgBuf + total, min(avail, jpgBufSize - total));
      if (r > 0) total += r;
    } else delay(1);
  }
  http.end();
  jpgLen = total;
  return (total > 2000 && jpgBuf[0] == 0xFF && jpgBuf[1] == 0xD8);
}

// Interroge /info d'une IP : true si c'est une ESP32-CAM (recupere son nom)
bool probeCam(const String& ip, String& name, int timeoutMs) {
  HTTPClient http;
  http.begin("http://" + ip + "/info");
  http.setTimeout(timeoutMs);
  int code = http.GET();
  if (code != HTTP_CODE_OK) { http.end(); return false; }
  String body = http.getString();
  http.end();
  if (body.indexOf("ESP32-CAM") < 0) return false;
  int n = body.indexOf("\"name\":\"");
  if (n >= 0) {
    int e = body.indexOf("\"", n + 8);
    if (e > n + 8) name = body.substring(n + 8, e);
    else name = ip;
  } else name = ip;
  return true;
}

// Cherche un motif dans un flux
bool findInStream(WiFiClient* s, const char* pat, uint32_t timeoutMs) {
  size_t plen = strlen(pat);
  size_t matched = 0;
  unsigned long start = millis();
  while (millis() - start < timeoutMs) {
    if (s->available()) {
      char c = (char)s->read();
      if (c == pat[matched]) {
        matched++;
        if (matched == plen) return true;
      } else {
        matched = (c == pat[0]) ? 1 : 0;
      }
    } else delay(1);
  }
  return false;
}

// Lit UNE frame JPEG du flux MJPEG dans jpgBuf
bool readOneFrame(WiFiClient* s) {
  if (!findInStream(s, "Content-Length:", 3000)) return false;
  char numBuf[12];
  int ni = 0;
  unsigned long start = millis();
  // peek() : ne pas consommer le \r final (sinon le \r\n\r\n suivant est casse)
  while (ni < 11 && millis() - start < 1000) {
    if (s->available()) {
      char c = (char)s->peek();
      if (c >= '0' && c <= '9') { numBuf[ni++] = (char)s->read(); }
      else if (ni > 0) break;          // fin du nombre, \r reste dans le flux
      else s->read();                  // ignore les espaces
    } else delay(1);
  }
  numBuf[ni] = 0;
  long len = atol(numBuf);
  if (len <= 0 || len > (long)jpgBufSize) return false;
  if (!findInStream(s, "\r\n\r\n", 1000)) return false;
  size_t got = 0;
  start = millis();
  while (got < (size_t)len && millis() - start < 4000) {
    if (s->available()) {
      size_t chunk = min((size_t)s->available(), (size_t)len - got);
      int r = s->readBytes(jpgBuf + got, chunk);
      if (r > 0) got += r;
    } else delay(1);
  }
  jpgLen = got;
  return (got == (size_t)len && jpgBuf[0] == 0xFF && jpgBuf[1] == 0xD8);
}

// ============================ INTERFACE =============================

const int TOOLBAR_Y = 240;   // barre de boutons en bas (32 px)
const int GRID_H = 240;      // zone grille au-dessus

// ------- barre d'outils : [Scanner] [Ajouter] [Effacer] -------
void drawToolbar() {
  tft.fillRect(0, TOOLBAR_Y, 480, 32, 0x2104);
  const char* labels[3] = { "Scanner", "+ Ajouter", "Effacer" };
  uint16_t colors[3] = { 0x041F, 0x040F, 0x800F };  // bleu, vert, rouge fonce
  for (int i = 0; i < 3; i++) {
    int bx = 8 + i * 158;
    tft.fillRoundRect(bx, TOOLBAR_Y + 4, 144, 24, 5, colors[i]);
    tft.setTextColor(TFT_WHITE, colors[i]);
    tft.setFont(&fonts::Font2);
    tft.drawCentreString(labels[i], bx + 72, TOOLBAR_Y + 8);
  }
}

