Silexperience210/esp32-cam-surveillance-system/firmware/esp32-s3-monitor/esp32-viewer-s3.ino
int toolbarAt(int tx, int ty) {
  if (ty < TOOLBAR_Y) return -1;
  for (int i = 0; i < 3; i++) {
    int bx = 8 + i * 158;
    if (tx >= bx && tx < bx + 144) return i;
  }
  return -1;
}

// ------- grille de cameras -------
void tileRect(int idx, int &x, int &y, int &w, int &h) {
  if (nbCams <= 2) {
    w = 480 / max(nbCams, 1); h = GRID_H;
    x = idx * w; y = 0;
  } else {
    w = 240; h = GRID_H / 2;
    x = (idx % 2) * 240;
    y = (idx / 2) * (GRID_H / 2);
  }
}

int tileAt(int tx, int ty) {
  for (int i = 0; i < nbCams; i++) {
    int x, y, w, h;
    tileRect(i, x, y, w, h);
    if (tx >= x && tx < x + w && ty >= y && ty < y + h) return i;
  }
  return -1;
}

void drawTileLabel(int idx) {
  int x, y, w, h;
  tileRect(idx, x, y, w, h);
  tft.setClipRect(x, y, w, h);
  tft.fillRect(x, y + h - 20, w, 20, TFT_BLACK);
  tft.setTextColor(camOnline[idx] ? TFT_WHITE : TFT_RED, TFT_BLACK);
  tft.setFont(&fonts::Font2);
  tft.setCursor(x + 6, y + h - 17);
  tft.print(cams[idx].name);
  if (!camOnline[idx]) tft.print(" (hors ligne)");
  tft.clearClipRect();
}

void drawOfflineTile(int idx) {
  int x, y, w, h;
  tileRect(idx, x, y, w, h);
  tft.setClipRect(x, y, w, h);
  tft.fillRect(x, y, w, h, 0x2104);
  tft.setTextColor(TFT_RED, 0x2104);
  tft.setFont(&fonts::Font4);
  tft.drawCentreString("OFFLINE", x + w / 2, y + h / 2 - 22);
  tft.clearClipRect();
  drawTileLabel(idx);
}

void drawTileJpg(int idx) {
  int x, y, w, h;
  tileRect(idx, x, y, w, h);
  tft.setClipRect(x, y, w, h);
  int jx = x + (w - 200) / 2;
  int jy = y + (h - 150) / 2;
  tft.drawJpg(jpgBuf, jpgLen, jx, jy, 200, 150, 0, 0, lgfx::jpeg_div::JPEG_DIV_4);
  tft.clearClipRect();
  drawTileLabel(idx);
}

void drawGridFrame() {
  tft.fillScreen(TFT_BLACK);
  if (nbCams == 0) {
    tft.setTextColor(TFT_YELLOW, TFT_BLACK);
    tft.setFont(&fonts::Font4);
    tft.drawCentreString("Aucune camera", 240, 80);
    tft.setTextColor(TFT_WHITE, TFT_BLACK);
    tft.setFont(&fonts::Font2);
    tft.drawCentreString("Touche [Scanner] pour detecter les cameras", 240, 125);
    tft.drawCentreString("ou [+ Ajouter] pour saisir une IP", 240, 145);
  } else {
    for (int i = 0; i < nbCams; i++) {
      int x, y, w, h;
      tileRect(i, x, y, w, h);
      tft.drawRect(x, y, w, h, 0x4208);
      drawTileLabel(i);
    }
  }
  drawToolbar();
}

void drawFullJpg() {
  // image 400x272 a x=40 : les bandes x<40 et x>440 ne sont pas touchees
  // Source = 480x320 (fs=hvga) : plus de division, on recadre au centre sur 400x272.
  tft.drawJpg(jpgBuf, jpgLen, 40, 0, 400, 272, 40, 24, lgfx::jpeg_div::JPEG_DIV_NONE);
}

// ------- bouton LED (plein ecran, bande laterale gauche) -------
bool fullLedState = false;

void drawLedButton() {
  uint16_t col = fullLedState ? TFT_YELLOW : 0x4208;
  tft.fillRoundRect(4, 100, 32, 60, 6, col);
  tft.setTextColor(fullLedState ? TFT_BLACK : TFT_WHITE, col);
  tft.setFont(&fonts::Font2);
  tft.drawCentreString("LED", 20, 122);
}

void fetchLedState() {
  HTTPClient http;
  http.begin("http://" + cams[fullCamIndex].ip + "/led");
  http.setTimeout(1500);
  if (http.GET() == HTTP_CODE_OK) {
    String body = http.getString();
    fullLedState = body.indexOf("\"led\":true") >= 0;
  }
  http.end();
}

void toggleCamLed() {
  HTTPClient http;
  http.begin("http://" + cams[fullCamIndex].ip + "/led?state=toggle");
  http.setTimeout(1500);
  if (http.GET() == HTTP_CODE_OK) {
    String body = http.getString();
    fullLedState = body.indexOf("\"led\":true") >= 0;
    Serial.printf("LED %s : %s\n", cams[fullCamIndex].name.c_str(), fullLedState ? "ON" : "OFF");
  }
  http.end();
  drawLedButton();
}

// ------- ecran scan -------
void drawScanProgress(int i, const String& currentIp) {
  tft.fillScreen(TFT_BLACK);
  tft.setTextColor(TFT_CYAN, TFT_BLACK);
  tft.setFont(&fonts::Font4);
  tft.drawCentreString("Scan du reseau...", 240, 50);
  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.setFont(&fonts::Font2);
  tft.drawCentreString(currentIp, 240, 100);
  tft.drawCentreString(String(nbCams) + " camera(s) trouvee(s)", 240, 130);
  // barre de progression
  tft.drawRect(40, 170, 400, 22, TFT_WHITE);
  tft.fillRect(42, 172, (396 * i) / 254, 18, 0x040F);
  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.drawCentreString(String((i * 100) / 254) + " %", 240, 172);
  // bouton annuler
  tft.fillRoundRect(180, 215, 120, 32, 6, 0x800F);
  tft.setTextColor(TFT_WHITE, 0x800F);
  tft.drawCentreString("Annuler", 240, 223);
}

// ------- clavier numerique (ajout manuel) -------
const int KEY_W = 116, KEY_H = 40, KEY_GAP = 6;
const int KEY_X0 = 52, KEY_Y0 = 88;
const char KEYS[4][3] = { {'1','2','3'}, {'4','5','6'}, {'7','8','9'}, {'.','0','<'} };

void drawIpField() {
  tft.fillRect(40, 36, 292, 40, TFT_BLACK);
  tft.drawRect(40, 36, 292, 40, TFT_WHITE);
  tft.setTextColor(TFT_CYAN, TFT_BLACK);
  tft.setFont(&fonts::Font4);
  tft.setCursor(48, 44);
  tft.print(inputIp.length() ? inputIp : " ");
}

void drawNumpad() {
  tft.fillScreen(TFT_BLACK);
  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.setFont(&fonts::Font2);
  tft.drawCentreString("Ajouter une camera (IP)", 240, 12);
  drawIpField();
  // boutons OK / X
  tft.fillRoundRect(340, 36, 64, 40, 6, 0x040F);
  tft.setTextColor(TFT_WHITE, 0x040F);
  tft.setFont(&fonts::Font2);
  tft.drawCentreString("OK", 372, 48);
  tft.fillRoundRect(412, 36, 52, 40, 6, 0x800F);
  tft.setTextColor(TFT_WHITE, 0x800F);
  tft.drawCentreString("X", 438, 48);
  // touches
  for (int r = 0; r < 4; r++) {
    for (int c = 0; c < 3; c++) {
      int kx = KEY_X0 + c * (KEY_W + KEY_GAP);
      int ky = KEY_Y0 + r * (KEY_H + KEY_GAP);
      tft.fillRoundRect(kx, ky, KEY_W, KEY_H, 6, 0x2104);
      tft.setTextColor(TFT_WHITE, 0x2104);
      tft.setFont(&fonts::Font4);
      tft.drawCentreString(String(KEYS[r][c]), kx + KEY_W / 2, ky + 8);
    }
  }
  if (addMessage.length()) {
    tft.setTextColor(TFT_YELLOW, TFT_BLACK);
    tft.setFont(&fonts::Font2);
    tft.drawCentreString(addMessage, 240, 262);
  }
}

// retourne la touche : '0'-'9', '.', '<' (effacer), 'O' (OK), 'C' (annuler), 0 = rien
char numpadKeyAt(int tx, int ty) {
  if (ty >= 36 && ty < 76) {
    if (tx >= 340 && tx < 404) return 'O';
    if (tx >= 412 && tx < 464) return 'C';
  }
  for (int r = 0; r < 4; r++) {
    for (int c = 0; c < 3; c++) {
      int kx = KEY_X0 + c * (KEY_W + KEY_GAP);
      int ky = KEY_Y0 + r * (KEY_H + KEY_GAP);
      if (tx >= kx && tx < kx + KEY_W && ty >= ky && ty < ky + KEY_H) return KEYS[r][c];
    }
  }
  return 0;
}

void waitRelease() {
  uint16_t tx, ty;
  while (tft.getTouch(&tx, &ty)) delay(10);
}

