Silexperience210/esp32-cam-surveillance-system/firmware/esp32-s3-monitor/esp32-viewer-s3.ino
// ============================ MODES =================================

void updateTile(int idx) {
  if (fetchCapture(cams[idx].ip)) {
    bool wasOffline = !camOnline[idx];
    camOnline[idx] = true;
    drawTileJpg(idx);
    if (wasOffline) drawTileLabel(idx);
  } else {
    if (camOnline[idx]) {
      camOnline[idx] = false;
      drawOfflineTile(idx);
    }
  }
}

void startScan() {
  viewMode = MODE_SCAN;
  nbCams = 0;
  bool cancelled = false;

  // 1) Decouverte mDNS (instantane) : les cameras a jour s'annoncent
  drawScanProgress(0, "Recherche mDNS...");
  int found = MDNS.queryService("esp32cam", "tcp");
  Serial.printf("mDNS : %d camera(s) detectee(s)\n", found);
  for (int i = 0; i < found && nbCams < MAX_CAMS; i++) {
    // core ESP32 2.x : MDNS.IP(idx) / core 3.x : MDNS.address(idx)
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
    String ip = MDNS.address(i).toString();
#else
    String ip = MDNS.IP(i).toString();
#endif
    String name;
    if (!probeCam(ip, name, ADD_TIMEOUT_MS)) name = MDNS.hostname(i);
    cams[nbCams].ip = ip;
    cams[nbCams].name = name;
    nbCams++;
    Serial.printf("  -> %s (%s)\n", name.c_str(), ip.c_str());
  }

  // 2) Fallback : scan IP complet si aucune camera mDNS trouvee
  if (nbCams > 0) {
    saveCams();
    for (int i = 0; i < 4; i++) camOnline[i] = false;
    gridCursor = 0;
    viewMode = MODE_GRID;
    drawGridFrame();
    return;
  }

  IPAddress ip = WiFi.localIP();
  String subnet = String(ip[0]) + "." + String(ip[1]) + "." + String(ip[2]) + ".";
  int myLast = ip[3];

  for (int i = 1; i <= 254 && !cancelled; i++) {
    if (i == myLast) continue;
    drawScanProgress(i, subnet + String(i));
    String name;
    if (probeCam(subnet + String(i), name, PROBE_TIMEOUT_MS)) {
      if (nbCams < MAX_CAMS) {
        cams[nbCams].ip = subnet + String(i);
        cams[nbCams].name = name;
        nbCams++;
        Serial.printf("Camera trouvee : %s (%s)\n", name.c_str(), (subnet + String(i)).c_str());
      }
    }
    // bouton Annuler (zone 180,215,120,32)
    uint16_t tx, ty;
    if (tft.getTouch(&tx, &ty)) {
      if (tx >= 180 && tx < 300 && ty >= 215 && ty < 247) {
        waitRelease();
        cancelled = true;
      }
    }
    delay(1);
  }
  saveCams();
  for (int i = 0; i < 4; i++) camOnline[i] = false;
  gridCursor = 0;
  viewMode = MODE_GRID;
  drawGridFrame();
}

void startAdd() {
  viewMode = MODE_ADD;
  inputIp = "";
  addMessage = "";
  drawNumpad();
}

void addTask() {
  uint16_t tx, ty;
  if (!tft.getTouch(&tx, &ty)) return;
  char key = numpadKeyAt(tx, ty);
  waitRelease();
  if (!key) return;

  if (key >= '0' && key <= '9' && inputIp.length() < 15) {
    inputIp += key;
    drawIpField();
  } else if (key == '.' && inputIp.length() < 15 && inputIp.length() > 0 &&
             !inputIp.endsWith(".")) {
    inputIp += '.';
    drawIpField();
  } else if (key == '<') {
    inputIp.remove(inputIp.length() - 1);
    drawIpField();
  } else if (key == 'C') {
    viewMode = MODE_GRID;
    drawGridFrame();
  } else if (key == 'O') {
    if (inputIp.length() < 7) {
      addMessage = "IP incomplete !";
    } else {
      addMessage = "Test de " + inputIp + " ...";
      drawNumpad();
      String name;
      if (probeCam(inputIp, name, ADD_TIMEOUT_MS)) {
        if (nbCams < MAX_CAMS) {
          cams[nbCams].ip = inputIp;
          cams[nbCams].name = name;
          nbCams++;
          saveCams();
          addMessage = "Camera ajoutee : " + name;
        } else {
          addMessage = "Maximum 4 cameras !";
        }
      } else {
        addMessage = "Aucune camera a cette IP";
      }
      drawNumpad();
      delay(1500);
      if (nbCams > 0 && addMessage.startsWith("Camera ajoutee")) {
        viewMode = MODE_GRID;
        drawGridFrame();
      } else {
        addMessage = "";
        drawNumpad();
      }
    }
  }
}

void gridTask() {
  if (nbCams > 0) {
    unsigned long interval = GRID_CYCLE_MS / max(nbCams, 1);
    if (millis() - lastGridFetch >= interval) {
      lastGridFetch = millis();
      updateTile(gridCursor);
      gridCursor = (gridCursor + 1) % nbCams;
    }
  }

  uint16_t tx, ty;
  if (tft.getTouch(&tx, &ty)) {
    int btn = toolbarAt(tx, ty);
    if (btn >= 0) {
      waitRelease();
      if (btn == 0) startScan();
      else if (btn == 1) startAdd();
      else if (btn == 2) {
        // Effacer : double tap pour confirmer
        if (pendingClear && millis() - pendingClearMs < 3000) {
          nbCams = 0;
          saveCams();
          pendingClear = false;
          for (int i = 0; i < 4; i++) camOnline[i] = false;
          drawGridFrame();
        } else {
          pendingClear = true;
          pendingClearMs = millis();
          tft.fillRect(0, TOOLBAR_Y, 480, 32, 0x800F);
          tft.setTextColor(TFT_WHITE, 0x800F);
          tft.setFont(&fonts::Font2);
          tft.drawCentreString("Retouche [Effacer] pour confirmer", 240, TOOLBAR_Y + 8);
          delay(300);
          waitRelease();
          drawToolbar();
        }
      }
    } else if (nbCams > 0) {
      int idx = tileAt(tx, ty);
      if (idx >= 0) {
        waitRelease();
        fullCamIndex = idx;
        viewMode = MODE_FULL;
        tft.fillScreen(TFT_BLACK);
        tft.setTextColor(TFT_WHITE, TFT_BLACK);
        tft.setFont(&fonts::Font2);
        tft.drawCentreString(cams[idx].name + " - connexion...", 240, 130);
      }
    }
  }
}

void fullScreenTask() {
  HTTPClient http;
  // 480x320 : colle a la zone d'affichage -> 2,5x moins de WiFi et de decodage qu'en SVGA
  http.begin("http://" + cams[fullCamIndex].ip + "/stream?fs=hvga&q=14");
  http.setTimeout(HTTP_TIMEOUT_MS);
  int code = http.GET();
  if (code != HTTP_CODE_OK) {
    http.end();
    tft.setTextColor(TFT_RED, TFT_BLACK);
    tft.setFont(&fonts::Font2);
    tft.drawCentreString("Camera hors ligne - tapez pour revenir", 240, 130);
    while (true) {
      uint16_t tx, ty;
      if (tft.getTouch(&tx, &ty)) { waitRelease(); break; }
      delay(20);
    }
    viewMode = MODE_GRID;
    drawGridFrame();
    return;
  }

  WiFiClient* stream = http.getStreamPtr();
  Serial.printf("Stream plein ecran : %s\n", cams[fullCamIndex].name.c_str());
  fetchLedState();
  drawLedButton();
  unsigned long frames = 0, fpsStart = millis();

  while (http.connected()) {
    uint16_t tx, ty;
    if (tft.getTouch(&tx, &ty)) {
      if (tx < 40 && ty >= 90 && ty < 170) {
        waitRelease();
        toggleCamLed();        // tap sur le bouton LED
      } else {
        waitRelease();
        break;                 // tap ailleurs : retour grille
      }
    }
    if (!readOneFrame(stream)) break;
    drawFullJpg();
    frames++;
    if (millis() - fpsStart >= 10000) {
      Serial.printf("FPS : %.1f\n", frames / 10.0f);
      frames = 0; fpsStart = millis();
    }
    if (WiFi.status() != WL_CONNECTED) break;
  }
  http.end();
  viewMode = MODE_GRID;
  drawGridFrame();
}

// ============================ SETUP / LOOP ==========================

void setup() {
  Serial.begin(115200);
  Serial.println("\n=== Moniteur multi-cams v2 ===");

