Silexperience210/esp32-cam-surveillance-system/firmware/esp32-s3-monitor/esp32-viewer-s3.ino
  // DRAM interne en priorite : ~2x plus rapide a decoder que la PSRAM
  jpgBuf = (uint8_t*)heap_caps_malloc(JPG_BUF_SIZE, MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
  jpgBufSize = JPG_BUF_SIZE;
  if (!jpgBuf) {
    Serial.println("DRAM interne insuffisante -> repli PSRAM");
    jpgBuf = (uint8_t*)heap_caps_malloc(JPG_BUF_SIZE_PSRAM, MALLOC_CAP_SPIRAM);
    jpgBufSize = JPG_BUF_SIZE_PSRAM;
  } else {
    Serial.printf("jpgBuf en DRAM interne (%u ko)\n", (unsigned)(JPG_BUF_SIZE / 1024));
  }
  if (!jpgBuf) {
    Serial.println("ERREUR : PSRAM introuvable !");
    while (true) delay(1000);
  }

  tft.init();
  tft.fillScreen(TFT_BLACK);
  tft.setBrightness(255);
  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.setFont(&fonts::Font4);
  tft.drawCentreString("Moniteur cameras", 240, 100);

  loadConfig();

  bool wifiOk = false;
  if (cfgSsid.length() > 0) {
    WiFi.mode(WIFI_STA);
    WiFi.begin(cfgSsid.c_str(), cfgPass.c_str());
    WiFi.setSleep(false);
    tft.setFont(&fonts::Font2);
    tft.drawCentreString("Connexion WiFi...", 240, 150);
    Serial.print("Connexion WiFi '" + cfgSsid + "'");
    unsigned long start = millis();
    while (WiFi.status() != WL_CONNECTED && millis() - start < 20000) {
      delay(400);
      Serial.print(".");
    }
    Serial.println();
    wifiOk = (WiFi.status() == WL_CONNECTED);
  }

  if (!wifiOk) {
    startConfigPortal();
    return;
  }

  Serial.print("WiFi OK : ");
  Serial.println(WiFi.localIP());

  loadCams();
  Serial.printf("%d camera(s) configuree(s)\n", nbCams);

  // mDNS : permet de decouvrir les cameras du reseau
  if (MDNS.begin("esp32-viewer")) Serial.println("mDNS actif (viewer)");

  tft.fillScreen(TFT_BLACK);
  drawGridFrame();

  if (nbCams == 1) {
    fullCamIndex = 0;
    viewMode = MODE_FULL;
  }
}

void loop() {
  if (configMode) { delay(100); return; }

  // reconnexion WiFi automatique
  static unsigned long lastWifiRetry = 0;
  if (WiFi.status() != WL_CONNECTED && millis() - lastWifiRetry > 10000) {
    lastWifiRetry = millis();
    Serial.println("WiFi perdu, reconnexion...");
    WiFi.disconnect();
    WiFi.reconnect();
  }

  switch (viewMode) {
    case MODE_GRID: gridTask(); break;
    case MODE_FULL: fullScreenTask(); break;
    case MODE_ADD:  addTask(); break;
    case MODE_SCAN: break;  // startScan() est bloquant, appele depuis gridTask
  }
  delay(1);
}
